{"multiple_choice_questions": ["What is the main function of the background in a painting?", "Fauvism is a style of painting that emerged in which century?", "Which of the following artists was NOT part of the Impressionist movement?", "What type of art focuses on the accurate depiction of light and shadow, often creating a sense of depth and realism?", "Which famous artist painted the ceiling of the Sistine Chapel?", "What is the name of the art movement known for its distorted and surrealist representations of reality?", "Who is considered the father of Pop Art?", "What is the largest museum in the world dedicated to a single artist and his work?", "Which art movement is characterized by bold, often abstract forms and a focus on the artist's individual perception?", "What is the term for the art of decorating objects with intricate patterns and pictures, often using gold or silver?", "Who was a famous female painter during the Renaissance period, known for her portraits and religious paintings?", "What is the art form of creating three-dimensional sculptures using various materials?", "In what country was the Impressionist painter Claude Monet born?", "Which art movement emphasized the importance of the artist's emotional expression?", "What is the technique of applying paint in a series of thin, transparent layers, allowing light to shine through?", "Who was a famous American artist known for his unique style of using everyday objects in his sculptures?", "What is the term for an artistic technique using small colored stones or tiles to create images?"], "multiple_choice_choices": ["a) To provide a sense of depth\n    b) Make the foreground objects stand out\n    c) Add a vibrant contrast to the foreground\n    d) All of the above\n", "a) 18th\n    b) 19th\n    c) 20th\n    d) 21st\n", "a) Claude Monet\n    b) Edgar Degas\n    c) Paul Cézanne\n    d) Auguste Rodin\n", "a) Impressionism\n    b) Post-Impressionism\n    c) Realist Art\n    d) Expressionism\n", "a) Leonardo da Vinci\n    b) Michelangelo\n    c) Raphael\n    d) Donatello\n", "a) Cubism\n    b) Dadaism\n    c) Surrealism\n    d) Expressionism\n", "a) Andy Warhol\n    b) Roy Lichtenstein\n    c) Jasper Johns\n    d) Robert Rauschenberg\n", "a) The Louvre\n    b) Museu Picasso\n    c) Van Gogh Museum\n    d) Museum of Modern Art (MoMA)\n", "a) Impressionism\n    b) Expressionism\n    c) Surrealism\n    d) Cubism\n", "a) Engraving\n    b) Illuminating\n    c) Fresco\n    d) Mosaic\n", "a) Artemisia Gentileschi\n    b) Sofonisba Anguissola\n    c) Clara Peeters\n    d) All of the above\n", "a) Ceramics\n    b) Sculpture\n    c) Woodcut\n    d) Fresco painting\n", "a) France\n    b) Germany\n    c) Spain\n    d) Italy\n", "a) Impressionism\n    b) Expressionism\n    c) Cubism\n    d) Surrealism\n", "a) Scumbling\n    b) Glazing\n    c) Scabbling\n    d) Impasto\n", "a) Jeff Koons\n    b) Pop Art Man\n    c) Robert Rauschenberg\n    d) Andy Warhol\n", "a) Mosaic\n    b) Fresco\n    c) Pastel\n    d) Collage\n"], "multiple_choice_answers": ["d", "c", "d", "c", "b", "c", "a", "b", "b", "b", "a", "b", "a", "b", "b", "c", "a"], "written_questions": [], "written_answers": ["The Art Deco style brought a sense of luxury and glamour to the visual arts and design.", "Frida Kahlo's paintings left a profound legacy in the art world."]}