{"multiple_choice_questions": ["Which of the following best defines the term 'atomic number'?", "What is the name of the process in which an atom gains one or more electrons to become negatively charged?", "In what state of matter do particles have a fixed volume and a fixed shape?", "What is the symbol for the element carbon?", "Who was the chemist responsible for discovering the periodic table?", "What is the name of the law that states that the chemical properties of elements are periodic functions of their atomic numbers?", "Can the number of energy levels in an atom be greater than the atomic number?", "What is the term for the smallest possible fragment of an element?", "How many electrons does a neutral atom have in its outermost energy level?", "What is the maximum number of electrons an energy level can hold?", "In the equation A → B, what does the arrow indicate?", "What is the approximate pH value of neutral aqueous solutions?", "Which of the following elements is most likely to form multiple oxides?", "What is the definition of a molecule?", "Does a chemical equation show the number of molecules involved in the reaction?"], "multiple_choice_choices": ["a) The mass of an atom\n    b) The charge of the nucleus\n    c) The total number of electrons\n    d) The number of protons in the nucleus\n", "a) Ionization\n    b) Reduction\n    c) Oxidation\n    d) Reduction-oxidation\n", "a) Gas\n    b) Liquid\n    c) Solid\n    d) Plasma\n", "a) Cb\n    b) Cn\n    c) Cr\n    d) C\n", "a) John Dalton\n    b) Dmitri Mendeleev\n    c) Henry Cavendish\n    d) Michael Faraday\n", "a) Mendeleev's Law\n    b) Dalton's Law\n    c) Grimshaw's Law\n    d) The Periodic Law\n", "a) Yes\n    b) No, it's impossible\n    c) Only in certain elements\n    d) It depends on the element's state\n", "a) Molecule\n    b) Atom\n    c) Proton\n    d) Ion\n", "a) Equal to the number of protons\n    b) One more than the number of protons\n    c) Twice the number of protons\n    d) It varies depending on the element\n", "a) 2\n    b) 4\n    c) 8\n    d) 16\n", "a) A is a strong acid\n    b) A undergoes decay\n    c) A changes into B\n    d) B is a catalyst\n", "a) 1\n    b) 5\n    c) 7\n    d) 14\n", "a) Sodium\n    b) Helium\n    c) Iron\n    d) Neon\n", "a) An electrically charged particle\n    b) Two or more atoms bound together\n    c) A group of atoms arranged in an ionic lattice\n    d) A single atom\n", "a) Yes\n    b) No, only the number of atoms\n    c) Only for balanced equations\n    d) It varies depending on the reaction type\n"], "multiple_choice_answers": ["d", "a", "c", "d", "b", "d", "a", "b", "a", "c", "c", "c", "c", "b", "b"], "written_questions": ["Explain the difference between physical and chemical changes in matter. Provide examples of each.", "Describe the concept of electronegativity and how it influences the formation of covalent bonds."], "written_answers": ["Physical changes alter the physical properties of a substance without changing its chemical composition.", "Electronegativity is a property of atoms that reflects their ability to attract electrons towards themselves."]}