{"multiple_choice_questions": ["What was the name of the empire established by Alexander the Great?", "Which of the following best defines the term 'Dark Ages'?", "In which century did the Mongol Empire reach its peak of power and influence?", "What was the main religion of the Aztec Empire?", "Who was the famous Greek historian known for his works on the Peloponnesian War?", "What significant event occurred in 1453 CE that marked the end of a notable empire?", "Which famous explorer is credited with discovering America?", "What was the longest reign of a British monarch?", "In which year did the Battle of Bunker Hill take place, an early conflict of the American Revolution?", "Who was the first emperor of a unified China?", "What is the term for the ancient Chinese practice of burying servants and treasures with their deceased masters?", "Which famous philosopher wrote 'The Republic' and was a key figure in Western philosophy?", "Who was the fifth emperor of Rome, known for his military conquests and expansion?", "What was the cause of the French Revolution?", "Which country was not part of the Axis powers during World War II?"], "multiple_choice_choices": ["a) Roman Empire\n    b) Byzantine Empire\n    c) Persian Empire\n    d) Macedonian Empire\n", "a) A period of cultural decline and chaos after the fall of Rome\n    b) A mysterious era shrouded in legend, with little historical evidence\n    c) The early stages of the Renaissance, marked by scientific discoveries\n    d) A time of prosperity and stability in medieval Europe\n", "a) 12th century\n    b) 13th century\n    c) 14th century\n    d) 15th century\n", "a) Catholicism\n    b) Islam\n    c) Polytheism\n    d) Buddhism\n", "a) Herodotus\n    b) Thucydides\n    c) Homer\n    d) Plutarch\n", "a) The fall of the Aztec Empire\n    b) The Renaissance in Italy\n    c) The rise of the Ottoman Empire after conquering Constantinople\n    d) The signing of the Magna Carta\n", "a) Christopher Columbus\n    b) Marco Polo\n    c) James Cook\n    d) Ferdinand Magellan\n", "a) Queen Victoria\n    b) King Edward III\n    c) Henry VIII\n    d) Elizabeth II\n", "a) 1775\n    b) 1763\n    c) 1781\n    d) 1793\n", "a) Qin Shi Huang\n    b) Han Wendi\n    c) Liu Bang\n    d) Yongle Emperor\n", "a) Feng Shui\n    b) Confucianism\n    c) Jade Culture\n    d) burial rituals\n", "a) Socrates\n    b) Plato\n    c) Aristotle\n    d) Diogenes\n", "a) Caesar Augustus\n    b) Trajan\n    c) Nero\n    d) Claudius\n", "a) The Enlightenment and rising nationalism\n    b) A financial crisis due to excessive taxation\n    c) The influence of the Renaissance\n    d) Religious conflicts between Catholics and Protestants\n", "a) Japan\n    b) Germany\n    c) Italy\n    d) Hungary\n"], "multiple_choice_answers": ["d", "a", "b", "c", "b", "c", "a", "a", "a", "a", "d", "b", "d", "a", "d"], "written_questions": ["\nDescribe the contributions of Genghis Khan and his lasting impact on world history, focusing on his military conquests and cultural influence.\n", "\nExplain the causes and consequences of the Fall of Constantinople in 1453 CE, and its significance in world history.\n"], "written_answers": ["Genghis Khan, the legendary leader of the Mongol Empire, left an indelible mark on history through his breathtaking military conquests and the establishment of a vast, unified nation.", "The fall of Constantinople, the majestic capital of the Byzantine Empire, in 1453 CE to the Ottoman Turks, signifies a pivotal moment in world history."]}