{"multiple_choice_questions": ["What is the value of 42 multiplied by 8?", "Which of the following is NOT a prime number?", "A farmer wants to fence off a rectangular area for her goats to graze. The length of the area is twice its width. If the perimeter of the rectangle is 88 feet, what is the width of the grazing area?", "Susan has 10 apples and buys 6 more at the store. How many apples are there in total?", "What is the square root of 144?", "Jack counts the steps while walking from his house to the park. He records 360 steps from his house to the park and another 360 steps back to his house. Approximately how many centimeters would Jack have walked? (1 step approximately equals 80 centimeters)", "The diagonal of a rectangle measures 14 units, and one of its sides is 7 units. Using the Pythagorean Theorem, what would the length of the other side be?", "What is the largest three-digit number that can be formed using the digits 4, 6, and 8?", "A baker has 5 cakes and twice as many cupcakes. How many pastries does the baker have in total if there are 21 cakes?", "Simplify the expression 4x + 6x + 2x:"], "multiple_choice_choices": ["a) 336\n    b) 364\n    c) 416\n    d) 482\n", "a) 13\n    b) 19\n    c) 22\n    d) 23\n", "a) 11 feet\n    b) 12 feet\n    c) 22 feet\n    d) 44 feet\n", "a) 14\n    b) 15\n    c) 16\n    d) It's impossible to determine without further information.\n", "a) 12\n    b) 14.4\n    c) 16\n    d) 24\n", "a) 64 meters\n    b) 128 meters\n    c) 240 meters\n    d) 360 meters\n", "a) 7 units\n    b) 8 units\n    c) 10 units\n    d) 14 units\n", "a) 468\n    b) 648\n    c) 684\n    d) 846\n", "a) 26\n    b) 35\n    c) 49\n    d) 56\n", "a) 10x\n    b) 12x\n    c) 14x\n    d) 16x\n"], "multiple_choice_answers": ["a", "c", "b", "c", "c", "b", "c", "d", "c", "c"], "written_questions": ["Calculate the average speed in kilometers per hour of a journey that takes 4.5 hours, during which 210 kilometers are traveled.", "Find the equation of the line that passes through the points (3, 5) and (6, 7). "], "written_answers": ["The average speed would be approximately 47 kilometers per hour.", "y - 5 = 1/3 (x - 3) or a linear equation of your choice, using the points as coordinates."]}