{"multiple_choice_questions": ["What is the name of the musical genre that focuses on electronic sounds and technology?", "Which of the following instruments is known for its deep, bass-like sound and is a staple of many orchestra pieces?", "What is the term for the pattern of long and short durations in a musical composition?", "Who is widely considered one of the greatest composers in Western music history, known for his masterful symphonies and operas?", "What is the iconic guitar riff in the introduction to Led Zeppelin's \"Stairway to Heaven\" commonly known as?", "Which famous jazz musician and composer, known for his innovative use of harmony, was also a skilled pianist?", "What type of music, characterized by its fast pace and punk rock elements, became popular in the 1990s?", "Which classical composer's works include the famous \"Moonlight Sonata\" and are often associated with romanticism?", "What is the vocal style in which the singer uses a wide range of notes, often including high-pitched screams or shouts?", "The drum kit, a standard instrument in rock and roll bands, consists of which of the following instruments?", "Which famous musician is credited with revolutionizing jazz music and bringing a more modern sound to the genre?", "What is the oldest known musical instrument that's still played today?", "Which pop star, known for her distinctive vocals and songwriting skills, has won numerous Grammy Awards?", "In hip-hop music, what is the term for the spoken word part of a song, usually delivered rapidly and often containing social commentary?", "Who is the lead vocalist of the iconic rock band Queen?", "What is the slow, expressive style of playing an instrument, often associated with solo performances?"], "multiple_choice_choices": ["a) Jazz\n    b) Classical\n    c) Rock 'n' Roll\n    d) Electronic\n", "a) Flute\n    b) Trombone\n    c) Bass Guitar\n    d) Tuba\n", "a) Melody\n    b) Harmony\n    c) Rhythm\n    d) Tempo\n", "a) Johann Sebastian Bach\n    b) Ludwig van Beethoven\n    c) Wolfgang Amadeus Mozart\n    d) Giuseppe Verdi\n", "a) The Battle Riff\n    b) The Four Notes\n    c) The Stairway Riff\n    d) The Rock Intro\n", "a) Miles Davis\n    b) Louis Armstrong\n    c) Duke Ellington\n    d) Thelonious Monk\n", "a) Grunge\n    b) Techno\n    c) Ska\n    d) Speed Metal\n", "a) Frédéric Chopin\n    b) Franz Liszt\n    c) Ludwig van Beethoven\n    d) Johannes Brahms\n", "a) Belting\n    b) Falsetto\n    c) Scat Singing\n    d) Operatic\n", "a) Guitar, Bass Guitar, and Drums\n    b) Piano, Drums, and Bass\n    c) Drums, Cymbals, and Percussion\n    d) Guitar, Drums, and Piano\n", "a) Miles Davis\n    b) Charlie Parker\n    c) Louis Armstrong\n    d) Duke Ellington\n", "a) The Flute\n    b) The Guitar\n    c) The Drum\n    d) The Violin\n", "a) Taylor Swift\n    b) Katy Perry\n    c) Lady Gaga\n    d) Beyoncé\n", "a) Hook\n    b) Bridge\n    c) Rap\n    d) Beatbox\n", "a) Freddie Mercury\n    b) Roger Taylor\n    c) Brian May\n    d) John Deacon\n", "a) Legato\n    b) Staccato\n    c) Tempo Rubato\n    d) Rubato Lento\n"], "multiple_choice_answers": ["d", "d", "c", "a", "c", "d", "a", "c", "a", "c", "a", "a", "a", "c", "a", "d"], "written_questions": ["Describe the impact of musical legend Michael Jackson on the music industry and popular culture. How did he innovate and leave a lasting legacy?", "Explain the characteristics and origins of Gospel music, and provide an example of a famous song within this genre."], "written_answers": ["Michael Jackson's impact on the music industry cannot be overstated.", "Gospel music is a spiritual genre with roots in the African American community, often associated with Christian themes and values."]}