{"multiple_choice_questions": ["What is the speed of sound approximately equal to?", "According to the equation of continuity, which of the following is true for an incompressible fluid flow?", "What phenomenon describes the bending of sound waves as they encounter a change in medium?", "In the context of wave speed, what does the acronym \"ULF\" stand for?", "What is the name of the device that converts sound energy into electrical energy and vice versa?", "A sonic boom is an example of which type of wave?", "Which of the following best describes a standing wave?", "In an electromagnetic wave, the electric and magnetic fields oscillate perpendicular to each other. T or F?", "What is the maximum frequency of electromagnetic waves that the human eye can detect?", "Which part of the electromagnetic spectrum has the highest energy photons?", "What phenomenon involves the bending of light as it passes through a medium with a different refractive index?", "According to Snell's Law, which of the following describes the relationship between the angles of incidence and refraction?", "What is the name of the device that splits white light into its constituent colors?", "How do you calculate the image distance formed by a concave mirror?", "Can a convex lens be used to correct short-sightedness?", "What is the condition where light rays focus in front of the retina, leading to blurred vision?", "In a Young's double-slit experiment, which condition must be met to observe interference patterns?"], "multiple_choice_choices": ["a) 340 m/s\n    b) 340 km/h\n    c) 34 km/s\n    d) 3400 m/s\n", "a) The cross-sectional area increases as velocity increases.\n    b) The density of the fluid increases as velocity decreases.\n    c) The mass flow rate remains constant.\n    d) The pressure gradient is inversely proportional to the velocity.\n", "a) Diffraction\n    b) Reflection\n    c) Refraction\n    d) Absorption\n", "a) Ultra-Low Frequency\n    b) Ultra-High Frequency\n    c) Ultra-Longitudinal Frequency\n    d) Ultra-Sonic Frequency\n", "a) Speaker\n    b) Microphone\n    c) Amplifier\n    d) Compressor\n", "a) Transverse\n    b) Longitudinal\n    c) Surface\n    d) Electromagnetic\n", "a) A wave traveling from one medium to another\n    b) A wave reflected off a surface\n    c) A wave superposition resulting in a stationary pattern\n    d) A wave with a constant amplitude\n", "a) True\n    b) False\n", "a) 400 THz\n    b) 400 MHz\n    c) 400 GHz\n    d) 400 kHz\n", "a) Gamma rays\n    b) X-rays\n    c) Infrared rays\n    d) Radio waves\n", "a) Reflection\n    b) Refraction\n    c) Diffraction\n    d) Total internal reflection\n", "a) sin(incidence) = sin(refraction)\n    b) cos(incidence) = cos(refraction)\n    c) tan(incidence) = tan(refraction)\n    d) None of the above\n", "a) Spectrometer\n    b) Prism\n    c) Reflector\n    d) Polarizer\n", "a) Use the mirror equation and solve for the image distance.\n    b) Use the lens equation and divide the focal length by the image distance.\n    c) Multiply the object distance by the focal length.\n    d) Add the object and focal distances and divide by two.\n", "a) Yes, by altering the shape of the lens\n    b) Yes, but only with a sufficiently thick lens\n    c) No, it will worsen the condition\n    d) Convex lenses are not suitable for vision correction\n", "a) Myopia\n    b) Hyperopia\n    c) Astigmatism\n    d) Presbyopia\n", "a) The slits must be widely separated.\n    b) The screen must be placed very far from the slits.\n    c) The light source must emit coherent light.\n    d) The two slits must be aligned vertically.\n"], "multiple_choice_answers": ["a", "c", "c", "b", "b", "b", "c", "a", "c", "a", "b", "a", "b", "a", "c", "b", "c"], "written_questions": ["Explain the principle of operation of a microphone and name the type of microphone that works based on this principle.", "Describe the process of image formation in a concave mirror, including the various types of images that can be formed."], "written_answers": ["A microphone works by converting sound waves into electrical signals.", "Concave mirrors reflect incident light rays back toward the mirror's focal point."]}