{"multiple_choice_questions": ["What is the SI unit for measurement of electric current?", "According to Faraday's law of electromagnetic induction, what happens when the magnetic field around a conductor changes? ", "What is the maximum number of electrons in the second energy level of an atom?", "In a circuit, what does the voltage represent?", "What phenomenon involves the bending of light as it passes through a medium with a different refractive index?", "According to the photoelectric effect, what factor determines the kinetic energy of ejected electrons?", "What is the role of the control group in a scientific experiment?", "In a gravitational potential energy experiment, what would the unit be for the energy measured in joules?", "Which of the following best defines momentum?", "What is the name of the law that states the refractive index of a medium is dependent on the angle of incidence?", "When a photon is absorbed by an atom, what typically happens?", "What is the principle behind the operation of an electric toaster?", "Regarding the dual-slit experiment, what does the term \"constructive interference\" refer to?", "In a circuit with a resistor, capacitor, and inductor, what component stores the most energy?", "What is the name of the device that converts mechanical energy into electrical energy?", "When a metal rod is heated and then cooled, what happens to the resistance?", "What type of mirror reflection results in a reversed image?", "In terms of energy conservation, what does the law of conservation of energy state?"], "multiple_choice_choices": ["a) Ampere\n    b) Volt\n    c) Ohm\n    d) Watt\n", "a) An electric current is induced\n    b) The conductor experiences a force\n    c) The resistance changes\n    d) The magnetic field strengthens\n", "a) 2\n    b) 8\n    c) 10\n    d) 18\n", "a) Electric current\n    b) Potential difference\n    c) Resistance\n    d) Power\n", "a) Reflection\n    b) Refraction\n    c) Diffraction\n    d) Dispersion\n", "a) Intensity of light\n    b) Wavelength of light\n    c) Frequency of light\n    d) Amplitude of light\n", "a) To observe the effect of the independent variable\n    b) Isolate the participants from the experiment\n    c) Maintain the experiment environment\n    d) Ensure the safety of the experimenters\n", "a) m^2/s^2\n    b) kg/s\n    c) N.m\n    d) m/s\n", "a) Mass multiplied by velocity\n    b) Force divided by mass\n    c) Acceleration due to gravity\n    d) Velocity added to mass\n", "a) Snell's Law\n    b) Gauss's Law\n    c) Ohm's Law\n    d) Kepler's Law\n", "a) An electron is emitted\n    b) An electron is absorbed\n    c) The atom gains mass\n    d) The energy of the atom increases\n", "a) Conversion of thermal energy to electrical energy\n    b) Resistance heating\n    c) Electromagnetic induction\n    d) Infrared radiation\n", "a) The formation of a single bright fringe\n    b) The creation of two separate slits\n    c) The destruction of the photon upon detection\n    d) The alignment of the slits\n", "a) Resistor\n    b) Capacitor\n    c) Inductor\n    d) They store the same amount\n", "a) Generator\n    b) Motor\n    c) Transformer\n    d) Conductometer\n", "a) It decreases then increases\n    b) It increases then decreases\n    c) It remains constant\n    d) It first increases, then decreases\n", "a) Specular reflection\n    b) Diffuse reflection\n    c) Refraction\n    d) Critical angle reflection\n", "a) Energy cannot be created or destroyed\n    b) Energy is always conserved\n    c) Energy is proportional to mass\n    d) Energy is only conserved in open systems\n"], "multiple_choice_answers": ["a", "a", "b", "b", "b", "c", "c", "a", "a", "a", "d", "b", "a", "b", "a", "b", "a", "a"], "written_questions": ["Explain the concept of Faraday's law of electromagnetic induction and its practical applications in daily life.", "Describe the photoelectric effect, including the key observations and its implications for our understanding of light and matter."], "written_answers": ["Faraday's law of electromagnetic induction explains the relationship between a changing magnetic field and the generation of an electric current.", "The photoelectric effect is a fundamental phenomenon where electrons are ejected from a metal surface when light is incident on it."]}