{"multiple_choice": ["Which of the following best describes velocity?", "A car travels 200 kilometers in 4 hours. What is its average speed?", "If an object's velocity changes from 10 m/s to 30 m/s in 5 seconds, what is its acceleration?", "Which equation represents Newton's Second Law of Motion?", "An object with a mass of 10 kg experiences a force of 50 Newtons. What is the acceleration of the object?", "What is the formula for calculating gravitational force between two objects?", "How much force is required to accelerate a 2 kg mass at 4 m/s²?", "Which unit is used to measure power?", "What is the power of a device that does 300 J of work in 10 seconds?", "How much kinetic energy does a 0.5 kg ball with a velocity of 10 m/s possess?"], "multiple_choice_choices": ["a) Change in position over time.\n    b) The rate of change of distance.\n    c) Speed in a particular direction.\n    d) The average speed over a journey.\n", "a) 25 km/h\n    b) 50 km/h\n    c) 75 km/h\n    d) 100 km/h\n", "a) 2 m/s²\n    b) 4 m/s²\n    c) 6 m/s²\n    d) 8 m/s²\n", "a) F = m * a\n    b) F = m / a\n    c) F = a / m\n    d) a = F / m\n", "a) 2 m/s²\n    b) 5 m/s^2\n    c) 10 m/s^2\n    d) 20 m/s^2\n", "a) F = G * m1 * m2 * d^2\n    b) F = m * v / t\n    c) F = m * a\n    d) F = p / t\n", "a) 2 N\n    b) 4 N\n    c) 8 N\n    d) 16 N\n", "a) Watt\n    b) Volt\n    c) Ampere\n    d) Ohm\n", "a) 20 W\n    b) 30 W\n    c) 60 W\n    d) 120 W\n", "a) 12.5 J\n    b) 25 J\n    c) 50 J\n    d) 100 J\n"], "multiple_choice_answers": ["c", "b", "b", "a", "c", "a", "c", "a", "b", "d"], "written_questions": ["Explain the difference between speed and velocity, providing an example scenario to illustrate your explanation.\n", "Describe the relationship between force, mass, and acceleration according to Newton's Second Law of Motion. Provide a relevant equation and explain each variable.\n"], "written_answers": ["Speed refers to the magnitude of how fast an object is moving, without considering the direction.", "Newton's Second Law of Motion states that the force acting on an object is directly proportional to its mass and the acceleration it undergoes."]}